/*===========================================================================================
概　略：クリア画面の処理をまとめたクラスヘッダー
作成日：12月14日
更新日：12月14日
制作者：永山治夢
=============================================================================================*/

//インクルード
#include "UnitBase.h"	//ユニットベースクラス
#include "Sprite.h"		//スプライトクラス

//多重定義防止処理
#pragma once

//ユニットベースクラスを継承
class Clear	: public UnitBase
{
	//スプライトクラスのインスタンスの作成
	Sprite* clear;

public:
	Clear();			//コンストラクタ
	~Clear();			//デストラクタ

	HRESULT Load();		//読み込み処理
	HRESULT Update();	//更新処理
	HRESULT Render();	//描画処理
};

