/*===========================================================================================
概　略：プレイシーンを扱う処理
作成日：6月26日
更新日：6月26日
制作者：永山治夢
=============================================================================================*/

//---------------インクルード-----------------------
#include "PlayScene.h"

#include "Player.h"		//プレイヤークラス
#include "Stage.h"		//ステージクラス


//――――――――――――――――――――――
//	コンストラクタ
//――――――――――――――――――――――
PlayScene::PlayScene()
{
	//ユニット追加
	unit.push_back(new Stage);		//ステージ
	unit.push_back(new Player);		//プレイヤー
}
