/*===========================================================================================
概　略：２Ｄの四角形を作るクラスのヘッダー定義
作成日：9月1日
更新日：9月1日
制作者：永山治夢
=============================================================================================*/

//インクルード
#include "Global.h"

//多重定義防止処理
#pragma once

class Quad
{
	//テクスチャオブジェクト
	LPDIRECT3DTEXTURE9 pTexture;

public:
	 Quad();			//コンストラクタ
	~Quad();			//デストラクタ

	HRESULT Load(char* fileName);										//読み込み処理
	HRESULT Draw(D3DXMATRIX* matWorld, D3DXMATRIX* matTex = NULL);		//四角形のポリゴン描画
};

