/*===========================================================================================
概　略：各ゲームユニットの親クラス
作成日：6月26日
更新日：6月26日
制作者：永山治夢
=============================================================================================*/

//---------------インクルード-----------------------
#include "UnitBase.h"


//――――――――――――――――――――――
//	読み込み処理
//――――――――――――――――――――――
HRESULT UnitBase::Load()
{
	return S_OK;	//成功を返す
}

//――――――――――――――――――――――
//	更新処理
//――――――――――――――――――――――
HRESULT UnitBase::Update()
{
	return S_OK;	//成功を返す
}

//――――――――――――――――――――――
//	衝突判定処理
//――――――――――――――――――――――
HRESULT UnitBase::Hit(UnitBase* pTarget)
{
	return S_OK;	//成功を返す
}

//――――――――――――――――――――――
//	描画処理
//――――――――――――――――――――――
HRESULT UnitBase::Render()
{
	return S_OK;	//成功を返す
}